### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-18T17:04:55.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:44",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:34" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:34/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.zip" -> "lambda-builds/f3a8a760135c72b05a53f4bbde32c80281dea5b2c9782498b35a31c8eb1935d9.zip"
!       s3_object_version              = "Ilfr6lHO24MxtxA6e4ex7tzG5pDq91wG" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "34" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "34" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "8e6ee78e248b4a46efa5ce83918946ce" -> (known after apply)
!       id                     = "lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.zip" -> (known after apply)
!       key                    = "lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.zip" -> "lambda-builds/f3a8a760135c72b05a53f4bbde32c80281dea5b2c9782498b35a31c8eb1935d9.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.zip" -> "./.terraform/lambda-builds/f3a8a760135c72b05a53f4bbde32c80281dea5b2c9782498b35a31c8eb1935d9.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "Ilfr6lHO24MxtxA6e4ex7tzG5pDq91wG" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/src",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/f3a8a760135c72b05a53f4bbde32c80281dea5b2c9782498b35a31c8eb1935d9.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/f3a8a760135c72b05a53f4bbde32c80281dea5b2c9782498b35a31c8eb1935d9.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7053271134175215729" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.zip" -> "./.terraform/lambda-builds/f3a8a760135c72b05a53f4bbde32c80281dea5b2c9782498b35a31c8eb1935d9.zip"
!           "timestamp" = "1692378218103362000" -> "1692388435076306200"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "1114317959450636573" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.zip" -> "./.terraform/lambda-builds/f3a8a760135c72b05a53f4bbde32c80281dea5b2c9782498b35a31c8eb1935d9.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:44" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-18T17:04:39.321+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:44" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/c4db47eaa04dfd591153386cb6e007c37aff0db08ae9c4c46ac9dbbac42000fa.zip" -> "builds/00f0feb87944cb510baa3817ce3aa0d6acc69a80c5f5a0fa9e2c4d79ef3aae5e.zip"
!       s3_object_version           = "a3YAq6AFHDOwk5Vcsvc9bTnb324UJfsQ" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "EWxZy7J4M/xYxxcFh0vN4xSrOeIFFWJ5b3kurtlsGoY=" -> (known after apply)
!       source_code_size            = 29773195 -> (known after apply)
!       version                     = "44" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "f2e4725db9119487029bf176f4279017-6" -> (known after apply)
!       id                     = "builds/c4db47eaa04dfd591153386cb6e007c37aff0db08ae9c4c46ac9dbbac42000fa.zip" -> (known after apply)
!       key                    = "builds/c4db47eaa04dfd591153386cb6e007c37aff0db08ae9c4c46ac9dbbac42000fa.zip" -> "builds/00f0feb87944cb510baa3817ce3aa0d6acc69a80c5f5a0fa9e2c4d79ef3aae5e.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/c4db47eaa04dfd591153386cb6e007c37aff0db08ae9c4c46ac9dbbac42000fa.zip" -> "builds/00f0feb87944cb510baa3817ce3aa0d6acc69a80c5f5a0fa9e2c4d79ef3aae5e.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "a3YAq6AFHDOwk5Vcsvc9bTnb324UJfsQ" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/00f0feb87944cb510baa3817ce3aa0d6acc69a80c5f5a0fa9e2c4d79ef3aae5e.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/00f0feb87944cb510baa3817ce3aa0d6acc69a80c5f5a0fa9e2c4d79ef3aae5e.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "616917043017522365" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/c4db47eaa04dfd591153386cb6e007c37aff0db08ae9c4c46ac9dbbac42000fa.zip" -> "builds/00f0feb87944cb510baa3817ce3aa0d6acc69a80c5f5a0fa9e2c4d79ef3aae5e.zip"
!           "timestamp" = "1692378219773636200" -> "1692388436811441800"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "1372555968190008456" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/c4db47eaa04dfd591153386cb6e007c37aff0db08ae9c4c46ac9dbbac42000fa.zip" -> "builds/00f0feb87944cb510baa3817ce3aa0d6acc69a80c5f5a0fa9e2c4d79ef3aae5e.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>